kriea/esp32-weather-station/src/headers/colors.h
// Color palette
#define COLOR_BG        0x0841  // Dark blue background
#define COLOR_PANEL     0x2945  // Panel background
#define COLOR_ACCENT    0x07FF  // Cyan accent
#define COLOR_SUCCESS   0x07E0  // Green
#define COLOR_TEXT      0xFFFF  // White text
#define COLOR_DANGER    0xF800  // Red

#define COLOR_ORANGE    0xFD20  // Orange
#define COLOR_YELLOW    0xFFE0  // Yellow
#define COLOR_LIME      0x07E0  // Lime green
#define COLOR_PURPLE    0xF81F  // Purple
#define COLOR_MAGENTA   0xF81F  // Magenta
#define COLOR_PINK      0xFE19  // Pink
#define COLOR_NAVY      0x000F  // Navy blue
#define COLOR_TEAL      0x0410  // Teal
#define COLOR_OLIVE     0x8400  // Olive
#define COLOR_MAROON    0x8000  // Maroon
#define COLOR_GRAY      0x8410  // Gray
#define COLOR_SILVER    0xC618  // Silver
#define COLOR_LIGHTGRAY 0xD69A  // Light gray
#define COLOR_DARKGRAY  0x4208  // Dark gray
#define COLOR_WHITE     0xFFFF  // White
#define COLOR_BLACK     0x0000  // Black
#define COLOR_BROWN     0x8200  // Brown
#define COLOR_GOLD      0xFEA0  // Gold
#define COLOR_CORAL     0xFF7F  // Coral
#define COLOR_SALMON    0xFC0E  // Salmon
#define COLOR_KHAKI     0xF6F0  // Khaki
#define COLOR_TURQUOISE 0x471A  // Turquoise
#define COLOR_SKYBLUE   0x867D  // Sky blue
#define COLOR_LIGHTBLUE 0xAEDD  // Light blue
#define COLOR_DARKBLUE  0x0010  // Dark blue
#define COLOR_INDIGO    0x4810  // Indigo
#define COLOR_VIOLET    0x901A  // Violet
#define COLOR_CRIMSON   0xD8A0  // Crimson
#define COLOR_SCARLET   0xF800  // Scarlet
#define COLOR_BEIGE     0xF7BE  // Beige
#define COLOR_TAN       0xD5B0  // Tan
#define COLOR_MINT      0x97FF  // Mint
#define COLOR_LAVENDER  0xE73F  // Lavender